---
title: Outline
classe: Autodesk.Revit.DB.Outline
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# Outline

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `outline.IsEmpty` | Boolean |
| `Boolean IsValidObject { get; }` | `outline.IsValidObject` | Boolean |
| `XYZ MaximumPoint { get; set; }` | `outline.MaximumPoint` | XYZ |
| `XYZ MinimumPoint { get; set; }` | `outline.MinimumPoint` | XYZ |
| `Void AddPoint(XYZ)` | `outline.AddPoint(point)` | Void |
| `Boolean Contains(XYZ, Double)` | `outline.Contains(point, tolerance)` | Boolean |
| `Boolean ContainsOtherOutline(Outline, Double)` | `outline.ContainsOtherOutline(otherOutline, tolerance)` | Boolean |
| `Void Dispose()` | `outline.Dispose()` | Void |
| `Double GetDiagonalLength()` | `outline.GetDiagonalLength()` | Double |
| `Boolean Intersects(Outline, Double)` | `outline.Intersects(outline, tolerance)` | Boolean |
| `Boolean IsScaleValid(Double)` | `outline.IsScaleValid(scale)` | Boolean |
| `Void Scale(Double)` | `outline.Scale(scale)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```